{
    "PLEASE NOTE": "DO NOT EDIT THE KEYS || Edit the values only || || If you change project details don't forget to rename the new image, add it to the public folder and rename it accordingly",
    "name": "Sagar Sen",
    "profession": "Full Stack Developer",
    "contents": {
        "experience": 3,
        "projects": 3,
        "clients": 5
    },
    "services": [
        {
            "header": "Android Development",
            "description": "Create seamless mobile apps with Kotlin, React Native and Flutter frameworks."
        },
        {
            "header": "Fontend Development",
            "description": "Craft engaging user interfaces with cutting-edge frontend development tools."
        },
        {
            "header": "Backend Development",
            "description": "Build robust server-side solutions using leading-edge backend development technologies."
        },
        {
            "header": "Technical Assistance",
            "description": "Provide comprehensive technical support and assistance for seamless problem resolution."
        },
        {
            "header": "Video Editor",
            "description": "Transform media with precision editing using advanced video editing tools."
        },
        {
            "header": "Content Writer",
            "description": "Communicate complex ideas effectively through skilled technical writing expertise."
        }
    ],
    "aboutMe": {
        "description": "Hello! I'm Sagar Sen, a dynamic individual deeply immersed in the realms of Full Stack development, Technical Assistance, and Video Editing. Currently advancing through my second year at Dr. Sudhir Chandra Sur Institute of Technology and Sports Complex, I'm driven by a relentless pursuit of knowledge and innovation. My journey is defined by a passion for technology and a commitment to delivering exceptional results. With a keen eye for detail and a creative flair, I aim to blend technical expertise with artistic vision to craft compelling digital experiences. Join me as I embark on a journey to push boundaries and make a meaningful impact in the world of technology and media.",
        "linkedin": "https://www.linkedin.com/in/sagar-sen1067/",
        "github": "https://github.com/sagarsen2023",
        "email": "sagarsen2023@gmail.com",
        "contactDescription": "If you want to get in touch with me then you can contact me via Linkedin or mail me via the follwing links",
        "resume": "https://drive.google.com/file/d/1Dm-cX5AECptW2rqVwcWJu9vUjmMFiRHx/view?usp=sharing"
    },
    "progressDetails": {
        "languages": {
            "HTML": 95,
            "CSS": 85,
            "JavaScript": 90,
            "C": 65,
            "Python": 60,
            "Dart": 85
        },
        "frameworks": {
            "React.js": 80,
            "Express.js": 80,
            "Tailwind CSS": 75,
            "Next.js": 85,
            "Flutter": 80
        },
        "others": {
            "Figma": 90,
            "Canva": 95,
            "Adobe Premiere Pro": 70,
            "Davinci Resolve": 85
        }
    },
    "available-Icons": [
        "html",
        "css",
        "js",
        "c",
        "python",
        "dart",
        "react",
        "express",
        "tailwind",
        "next",
        "flutter"
    ],
    "recentProjects": [
        {
            "name" : "Style.Loom",
            "description" : "This eCommerce platform is a robust and scalable application, meticulously crafted using Next.js with TypeScript, and MongoDB as the database solution. It caters to both end-users and administrators through its comprehensive dual-panel system.",
            "link" : "https://github.com/sagarsen2023/Style-Loom",
            "tech" : [
                "next", 
                "tailwind", 
                "js"
            ]
        },
        {
            "name": "RedCell Connect",
            "description": "RedCell Connect is a Flutter and Firebase-based platform that facilitates seamless communication between blood banks and hospitals. By just entering the details of the type of blood group and its quantity, hospitals can see their nearest blood banks. Also they can directly call the blood bank and view their location.",
            "link": "https://github.com/sagarsen2023/RedCell-Connect",
            "tech": [
                "flutter",
                "dart"
            ]
        },
        {
            "name": "Desktop Voice Assistant",
            "description": "This is a voice assistant program that uses the Bard API to fetch detailed answers to your queries and then provides a summary of the answer using text summarization. The program can open websites, play music, and answer questions using voice commands.",
            "link": "https://github.com/sagarsen2023/Desktop-voice-assistant",
            "tech": [
                "python"
            ]
        }
    ]
}
